Demo_Kabeli/src/Catalogs/ЖурналыУчетаКабельнойПродукции/ЖурналыУчетаКабельнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЖурналыУчетаКабельнойПродукции</name>
  <attributes>
    <name>Изм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукцииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Трассировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>ОткудаПомещение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОткудаОборудование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОткудаКоординаты</name>
      <type>
        <types>CatalogRef.Координаты</types>
      </type>
    </attributes>
    <attributes>
      <name>КудаПомещение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КудаОборудование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КудаКоординаты</name>
      <type>
        <types>CatalogRef.Координаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаПроекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Demo_Kabeli/src/InformationRegisters/ДанныеПоМонтажуКабельнойПродукции/ДанныеПоМонтажуКабельнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПоМонтажуКабельнойПродукции</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыМонтажа</types>
    </type>
  </resources>
  <resources>
    <name>ДлинаФактическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЖурналУчетаКабельнойЛинии</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Demo_Kabeli/src/Catalogs/ЖурналыУчетаКабельнойПродукции/ManagerModule.bsl
#Область Печать
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати                                = КомандыПечати.Добавить();  
	КомандаПечати.МенеджерПечати                 = "Справочник.ЖурналыУчетаКабельнойПродукции";
	КомандаПечати.Идентификатор                  = "ИКЖ"; 
	КомандаПечати.МестоРазмещения                = "ПодменюПечать";
	КомандаПечати.Представление                  = Нстр("ru='Исполнительный кабельный журнал'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ИКЖ");
	
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = СформироватьПечать(МассивОбъектов);
		ПечатнаяФорма.СинонимМакета     = Нстр("ru='ИКЖ'"); 
		ПечатнаяФорма.ПолныйПутьКМакету = "Справочник.ЖурналыУчетаКабельнойПродукции.ПФ_MXL_ИКЖ";
	КонецЕсли;
		
КонецПроцедуры

Функция СформироватьПечать(МассивОбъектов)
	
	ТабДокумент = Новый ТабличныйДокумент;	
	ТабДокумент.КлючПараметровПечати = "ПараметрыПечати_ИКЖ";  
	ТабДокумент.АвтоМасштаб          = Истина;    
	ТабДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ЖурналыУчетаКабельнойПродукции.ПФ_MXL_ИКЖ");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЖурналыУчетаКабельнойПродукции.КабельнаяЛиния) КАК Кабель,
	               |	ЖурналыУчетаКабельнойПродукции.Проект.НомерПроекта КАК НомерПроекта,
	               |	ЖурналыУчетаКабельнойПродукции.ОткудаКоординаты.X КАК X,
	               |	ЖурналыУчетаКабельнойПродукции.ОткудаКоординаты.Y КАК Y,
	               |	ЖурналыУчетаКабельнойПродукции.ОткудаКоординаты.Z КАК Z,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЖурналыУчетаКабельнойПродукции.ОткудаПомещение) КАК Откуда,
	               |	ЖурналыУчетаКабельнойПродукции.КудаКоординаты.X КАК X1,
	               |	ЖурналыУчетаКабельнойПродукции.КудаКоординаты.Y КАК Y1,
	               |	ЖурналыУчетаКабельнойПродукции.КудаКоординаты.Z КАК Z1,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЖурналыУчетаКабельнойПродукции.КудаПомещение) КАК Куда,
	               |	ЖурналыУчетаКабельнойПродукции.ДлинаПроекта КАК Длина,
	               |	ДанныеПоМонтажуКабельнойПродукцииСрезПоследних.Период КАК ДатаПрокладки,
	               |	ДанныеПоМонтажуКабельнойПродукцииСрезПоследних.Исполнитель КАК Исполнитель,
	               |	ДанныеПоМонтажуКабельнойПродукцииСрезПоследних.Подрядчик КАК Подрядчик
	               |ИЗ
	               |	Справочник.ЖурналыУчетаКабельнойПродукции КАК ЖурналыУчетаКабельнойПродукции
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоМонтажуКабельнойПродукции.СрезПоследних КАК ДанныеПоМонтажуКабельнойПродукцииСрезПоследних
	               |		ПО ЖурналыУчетаКабельнойПродукции.Ссылка = ДанныеПоМонтажуКабельнойПродукцииСрезПоследних.ЖурналУчетаКабельнойЛинии
	               |ГДЕ
	               |	ЖурналыУчетаКабельнойПродукции.Ссылка В(&Ссылка)";
	
	Результат = Запрос.Выполнить();	
	Выборка   = Результат.Выбрать();
	
	ИмяПоля = "";	
	Для Каждого ТекКолонка Из Результат.Колонки Цикл
		ИмяПоля = ИмяПоля + ?(ИмяПоля = "", "", ",") + ТекКолонка.Имя;	
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеПараметров = Новый Структура(ИмяПоля);		
		ЗаполнитьЗначенияСвойств(ДанныеПараметров, Выборка); 	
		
		ДанныеПараметров.Вставить("ДатаФормирования", ТекущаяДата());
		
		Шапка = Макет.ПолучитьОбласть("Шапка");		
		Шапка.Параметры.Заполнить(ДанныеПараметров); 
		ТабДокумент.Вывести(Шапка);
		
		Сноска = Макет.ПолучитьОбласть("Сноска1");
		ТабДокумент.Вывести(Сноска);
		
		ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабДокумент.Вывести(ШапкаТаблицы);
		
		СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");     
		СтрокаТаблицы.Параметры.Заполнить(ДанныеПараметров);
		ТабДокумент.Вывести(СтрокаТаблицы);

		СведенияОбПодрядчике = ОрганизацииСервер.СведенияОбОрганизации(Выборка.Подрядчик);
		ДанныеПараметров.Вставить("ОтветственноеЛицоПодрядчика", СведенияОбПодрядчике.ОтветственноеЛицо);
		
		ПодписиИПечати = Новый Соответствие;		
		УправлениеПечатьюПереопределяемый.ПриПолученииПодписейИПечатейответственного(СведенияОбПодрядчике.ОтветственноеЛицо, ПодписиИПечати);
		
		Подписи = Макет.ПолучитьОбласть("Подписи");
		Подписи.Параметры.Заполнить(ДанныеПараметров); 
		
		Если ЗначениеЗаполнено(СведенияОбПодрядчике.ОтветственноеЛицо) Тогда
			Подписи.Рисунки.ПодписьПодрядчика.Картинка = ПодписиИПечати.Получить(
														 СведенияОбПодрядчике.ОтветственноеЛицо).ПодписьПодрядчика;			
		КонецЕсли;
		
		ТабДокумент.Вывести(Подписи);
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции
#КонецОбласти

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	
	
КонецПроцедуры
